{
  "title": "AndiHealth",
  "subtitle": "Kétnyelvű fitness foglalási platform az edge-en",
  "description": "Kétnyelvű weboldal és időpontfoglaló rendszer egy medical fitness oktató számára, Cloudflare Workers-ön Hono és D1 technológiával — külső függőségek nélkül, szerver oldali renderelés.",
  "content": {
    "overview": "Az AndiHealth egy kétnyelvű (magyar/angol) weboldal és online foglalási platform egy diplomás medical fitness és Pilates oktatónak Esztergomban. Az oldal egyszerre szolgál nyilvános bemutatkozásként és teljes időpontkezelő rendszerként — az órarend kezeléstől a foglalásokon át a bérletkezelésig és admin felületig.",
    "challenge": "Az ügyfélnek egy gyors, megbízható és költséghatékony platformra volt szüksége, amely kezelni tudja a kétnyelvű tartalmat, a valós idejű óra-elérhetőséget, az online foglalási folyamatot és az adminisztrációs felületet — mindezt hagyományos hosting és komplex keretrendszerek nélkül.",
    "solution": "A teljes alkalmazást a Cloudflare edge platformjára építettük: Hono keretrendszerrel szerver oldali JSX rendereléshez, D1 (SQLite) adatbázissal és Tailwind CSS-sel. Az eredmény egy külső függőségek nélküli, globálisan gyors alkalmazás, amely teljes egészében a Cloudflare ingyenes szintjén fut, kliensoldali JavaScript keretrendszer nélkül."
  },
  "features": [
    {
      "title": "Online órafoglalás",
      "description": "Az ügyfelek dátum szerint böngészhetik az elérhető csoportos órákat, helyet foglalhatnak és visszaigazolást kapnak — regisztráció nélkül"
    },
    {
      "title": "Kétnyelvű HU/EN támogatás",
      "description": "Teljes magyar és angol tartalom automatikus nyelvi útválasztással és SEO-optimalizált alternatív linkekkel"
    },
    {
      "title": "Admin felület",
      "description": "Jelszóval védett irányítópult órák, lemondások, ügyfelek, bérletek kezeléséhez és foglalási áttekintéshez"
    },
    {
      "title": "Bérlet- és kreditrendszer",
      "description": "Többalkalmas bérletkezelés automatikus kreditlevonással és lejárat követéssel"
    }
  ]
}
